notes/coding/nlp_dataset_corpus_construction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 周日 16:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pytorch-style的数据集构建</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="梁子" />
</head>
<body>
<div id="content">
<h1 class="title">pytorch-style的数据集构建</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org88a58ab">1. pytorch定义数据集的基本样式</a>
<ul>
<li><a href="#orgc53d6bd">1.1. 在此之前, 看一看数据集</a></li>
<li><a href="#org4b4c7a9">1.2. pytorch对此的封装</a></li>
<li><a href="#orgf07e591">1.3. 调用数据集</a></li>
</ul>
</li>
<li><a href="#orgc3df36c">2. 对于NLP使用过程中的特殊说明</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
这篇文字写给实习生.
</p>
</blockquote>


<p>
训练集是进行深度学习训练的最重要环节。
现以NLP领域的例子展示做实验过程中涉及到对数据集进行处理的各种操作。
</p>
<div id="outline-container-org88a58ab" class="outline-2">
<h2 id="org88a58ab"><span class="section-number-2">1</span> pytorch定义数据集的基本样式</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc53d6bd" class="outline-3">
<h3 id="orgc53d6bd"><span class="section-number-3">1.1</span> 在此之前, 看一看数据集</h3>
<div class="outline-text-3" id="text-1-1">
<p>
数据集是什么?
数据集是这样的一种迭代器(简单理解,数据集就是一个列表), 这个迭代器里的每一个元素都是一个二元组(data, label). 比如,对于分类问题, 我们的数据就是图片,文本等等, 标签就是最终的分类结果, 
比如二分类问题,或许就是0和1.
</p>

<p>
所以,对于要做的实验,重点知道数据和标签是什么. 对于深度学习, 大概率 <b>数据就是输入,标签就是输出</b>.
</p>
</div>
</div>
<div id="outline-container-org4b4c7a9" class="outline-3">
<h3 id="org4b4c7a9"><span class="section-number-3">1.2</span> pytorch对此的封装</h3>
<div class="outline-text-3" id="text-1-2">
<p>
理解了数据集的基本格式,其实封装一个数据集就比较简单了. 需要在初始化的时候处理好数据, 然后在此基础上封装一个迭代器.
下面的代码是对一个基本例子的展示
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">NLG_Normal_dataset</span><span style="color: #AE81FF;">(</span>Dataset<span style="color: #AE81FF;">)</span>:
    <span style="color: #E6DB74;">"""NLG input format for normal model"""</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">__init__</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, tokenizer, mode=<span style="color: #E6DB74;">'train'</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">self</span>.max_sentence_length=tokenizer.get_max_seq_length<span style="color: #AE81FF;">()</span>
        <span style="color: #F92672;">self</span>.tokenizer=tokenizer

        <span style="color: #F92672;">self</span>.path=os.path.dirname<span style="color: #AE81FF;">(</span>os.path.dirname<span style="color: #66D9EF;">(</span>os.path.abspath<span style="color: #A6E22E;">(</span>__file__<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">with</span> <span style="color: #F92672;">open</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"./dicts_data_save_for_dataset.pk"</span>,<span style="color: #E6DB74;">'rb'</span><span style="color: #AE81FF;">)</span> <span style="color: #F92672;">as</span> f:
            <span style="color: #FD971F;">traindict</span>,<span style="color: #FD971F;">testdict</span>,<span style="color: #FD971F;">tunedict</span>=pickle.load<span style="color: #AE81FF;">(</span>f<span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">self</span>.dataset=<span style="color: #AE81FF;">[]</span>
        <span style="color: #75715E;"># </span><span style="color: #75715E;">&#27492;&#22788;&#21333;&#25315;&#35757;&#32451;&#38598;&#20316;&#20026;&#27979;&#35797;&#20363;&#23376;,&#20854;&#20182;&#22320;&#26041;&#20174;&#30053;.</span>
        <span style="color: #F92672;">for</span> response <span style="color: #F92672;">in</span> traindict.keys<span style="color: #AE81FF;">()</span>:
            <span style="color: #FD971F;">acts</span>=traindict<span style="color: #AE81FF;">[</span>response<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">string_act</span>=<span style="color: #E6DB74;">""</span>
            <span style="color: #F92672;">for</span> ele_ls <span style="color: #F92672;">in</span> acts:
                <span style="color: #FD971F;">per_seq</span>=<span style="color: #E6DB74;">""</span>
                <span style="color: #F92672;">for</span> ele <span style="color: #F92672;">in</span> ele_ls:
                    <span style="color: #FD971F;">per_seq</span>+=ele
                <span style="color: #FD971F;">string_act</span>+=per_seq+<span style="color: #E6DB74;">","</span>
            <span style="color: #FD971F;">output1</span>=<span style="color: #F92672;">self</span>.tokenizer.single_convert_text_into_indextokens_and_segment_id<span style="color: #AE81FF;">(</span>response<span style="color: #AE81FF;">)[</span>0<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">mask1</span>=<span style="color: #F92672;">self</span>.tokenizer.single_convert_text_into_indextokens_and_segment_id<span style="color: #AE81FF;">(</span>response<span style="color: #AE81FF;">)[</span>2<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">input2</span>=<span style="color: #F92672;">self</span>.tokenizer.single_convert_text_into_indextokens_and_segment_id<span style="color: #AE81FF;">(</span>string_act<span style="color: #AE81FF;">)[</span>0<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">mask2</span>=<span style="color: #F92672;">self</span>.tokenizer.single_convert_text_into_indextokens_and_segment_id<span style="color: #AE81FF;">(</span>string_act<span style="color: #AE81FF;">)[</span>2<span style="color: #AE81FF;">]</span>
            <span style="color: #F92672;">self</span>.dataset.append<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>input2,mask2<span style="color: #A6E22E;">)</span>,<span style="color: #A6E22E;">(</span>output1,mask1<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">__getitem__</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,i<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.dataset<span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">__len__</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>.dataset<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
我们不要先去看具体的细节, 这个数据集在封装模式上需要包括以下三个特点:
</p>
<ol class="org-ol">
<li>继承自Dataset. 实际上是继承自torch.utils.data.Dataset</li>
<li>需要有方法__getitem__ . 这个方法输入一个必要的索引i, 然后去返回迭代器的第i个样本. 也就是数据集里的第i个样本.</li>
<li>需要有方法__len__ . 这个方法输出整个迭代器的长度.</li>
</ol>

<p>
那么, 进行初始化的时候,主要是在干嘛? 其实就是在干一件事, 获得数据集样本列表. 也就是上面代码里的self.dataset变量.
</p>
</div>
</div>
<div id="outline-container-orgf07e591" class="outline-3">
<h3 id="orgf07e591"><span class="section-number-3">1.3</span> 调用数据集</h3>
<div class="outline-text-3" id="text-1-3">
<p>
比较简单,基本语法如下面第二行展示结果.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #FD971F;">test_dataset</span>=NLG_GPT2_dataset<span style="color: #AE81FF;">(</span>tokenizer=a_tokenizer, mode=<span style="color: #E6DB74;">'test'</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">test_loader</span>=DataLoader<span style="color: #AE81FF;">(</span>dataset=test_dataset, batch_size=args.batch_size, shuffle=<span style="color: #AE81FF;">True</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
DataLoader 来自于torch.utils.data.Dataloader
</p>

<p>
参数解释:
</p>
<ul class="org-ul">
<li>batch_szie: 规定batchsize</li>
<li>shuffle: 规定是否进行shuffle</li>
<li>dataset: 输入dataset</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc3df36c" class="outline-2">
<h2 id="orgc3df36c"><span class="section-number-2">2</span> 对于NLP使用过程中的特殊说明</h2>
<div class="outline-text-2" id="text-2">
<p>
NLP中, 使用huggingface transformers的话, 基本的流程(尤其对于中文)是这样的:
</p>
<ol class="org-ol">
<li>将自然语言文本分成token, 得到token list;</li>
<li>对token list 里的每一个元素, 都查询其在vocabulary list中的索引, 得到index tensor;</li>
<li>将index tensor输入到模型里.</li>
</ol>

<p>
上述整个过程在上面的数据集封装中, 上述方法被self.tokenizer.single_convert_text_into_indextokens_and_segment_id()所实现.
</p>

<p>
下面给出自己对已有接口的一个自定义化的工程上的封装示例.
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">MyTokenizer</span><span style="color: #AE81FF;">()</span>:
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">__init__</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, max_sentence_length=64<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">path</span>=os.path.dirname<span style="color: #AE81FF;">(</span>os.path.abspath<span style="color: #66D9EF;">(</span>__file__<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">self</span>.max_sentence_length=max_sentence_length
        <span style="color: #F92672;">self</span>.tokenizer=BertTokenizer.from_pretrained<span style="color: #AE81FF;">(</span>path+<span style="color: #E6DB74;">'/Novel_GPT'</span><span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">self</span>.tokenizer.add_special_tokens<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">{</span><span style="color: #E6DB74;">"additional_special_tokens"</span>:<span style="color: #A6E22E;">[</span><span style="color: #E6DB74;">"[DOMAIN]"</span>,<span style="color: #E6DB74;">"[NAME]"</span>,
             <span style="color: #E6DB74;">"[NAME_ATBTE]"</span>,
             <span style="color: #E6DB74;">"[AT_VALUE]"</span>,
             <span style="color: #E6DB74;">"[POSITIVE]"</span>,
             <span style="color: #E6DB74;">"[NEGATIVE]"</span>,
             <span style="color: #E6DB74;">"[MAYBE_YOU_LIKE]"</span>,
             <span style="color: #E6DB74;">"[DOYOU_LIKE_IT?]"</span>,
             <span style="color: #E6DB74;">"[DOYOU_LIKE_IT?]"</span><span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">__len__</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>.tokenizer<span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">single_convert_text_into_indextokens_and_segment_id</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,text<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">tokeniz_text</span> = <span style="color: #F92672;">self</span>.tokenizer.tokenize<span style="color: #AE81FF;">(</span>text<span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">indextokens</span> = <span style="color: #F92672;">self</span>.tokenizer.convert_tokens_to_ids<span style="color: #AE81FF;">(</span>tokeniz_text<span style="color: #AE81FF;">)</span>
        <span style="color: #75715E;"># </span><span style="color: #75715E;">indextokens.append(self.tokenizer.convert_tokens_to_ids('[EndOfResponse]'))</span>
        <span style="color: #FD971F;">input_mask</span> = <span style="color: #AE81FF;">[</span>1<span style="color: #AE81FF;">]</span> * <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens<span style="color: #AE81FF;">)</span>

        <span style="color: #F92672;">if</span> <span style="color: #F92672;">self</span>.max_sentence_length&lt;<span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens<span style="color: #AE81FF;">)</span>:
            <span style="color: #FD971F;">indextokens</span>=indextokens<span style="color: #AE81FF;">[</span>:<span style="color: #F92672;">self</span>.max_sentence_length<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">segment_id</span>=<span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #F92672;">self</span>.max_sentence_length
            <span style="color: #FD971F;">input_mask</span>=input_mask<span style="color: #AE81FF;">[</span>:<span style="color: #F92672;">self</span>.max_sentence_length<span style="color: #AE81FF;">]</span>
        <span style="color: #F92672;">else</span>:
            <span style="color: #FD971F;">pad_indextokens</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>.max_sentence_length-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>indextokens<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            indextokens.extend<span style="color: #AE81FF;">(</span>pad_indextokens<span style="color: #AE81FF;">)</span>
            <span style="color: #FD971F;">input_mask_pad</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>.max_sentence_length-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>input_mask<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            input_mask.extend<span style="color: #AE81FF;">(</span>input_mask_pad<span style="color: #AE81FF;">)</span>
            <span style="color: #FD971F;">segment_id</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #F92672;">self</span>.max_sentence_length

        <span style="color: #FD971F;">indextokens</span>=torch.tensor<span style="color: #AE81FF;">(</span>indextokens,dtype=torch.<span style="color: #F92672;">long</span><span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">segment_id</span>=torch.tensor<span style="color: #AE81FF;">(</span>segment_id,dtype=torch.<span style="color: #F92672;">long</span><span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">input_mask</span>=torch.tensor<span style="color: #AE81FF;">(</span>input_mask,dtype=torch.<span style="color: #F92672;">long</span><span style="color: #AE81FF;">)</span>

        <span style="color: #F92672;">return</span> indextokens,segment_id,input_mask

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">single_convert_text_into_tokeniz_textes</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,text<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">tokenize_text</span>=<span style="color: #F92672;">self</span>.tokenizer.tokenize<span style="color: #AE81FF;">(</span>text<span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">return</span> tokenize_text

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">convert_text_into_indextokens_and_segment_id</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,text1,text2,spl=<span style="color: #E6DB74;">'[SEP]'</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">tokeniz_text1</span> = <span style="color: #F92672;">self</span>.tokenizer.tokenize<span style="color: #AE81FF;">(</span>text1<span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">indextokens1</span> = <span style="color: #F92672;">self</span>.tokenizer.convert_tokens_to_ids<span style="color: #AE81FF;">(</span>tokeniz_text1<span style="color: #AE81FF;">)</span>

        <span style="color: #FD971F;">length_first</span>=<span style="color: #F92672;">self</span>.max_sentence_length//2
        <span style="color: #FD971F;">input_mask1</span> = <span style="color: #AE81FF;">[</span>1<span style="color: #AE81FF;">]</span> * <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens1<span style="color: #AE81FF;">)</span>

        <span style="color: #F92672;">if</span> length_first&lt;<span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens1<span style="color: #AE81FF;">)</span>:
            <span style="color: #FD971F;">indextokens1</span>=indextokens1<span style="color: #AE81FF;">[</span>:length_first<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">input_mask1</span>=input_mask1<span style="color: #AE81FF;">[</span>:length_first<span style="color: #AE81FF;">]</span>
        <span style="color: #F92672;">else</span>:
            <span style="color: #FD971F;">pad_indextokens1</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span>length_first-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>indextokens1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            indextokens1.extend<span style="color: #AE81FF;">(</span>pad_indextokens1<span style="color: #AE81FF;">)</span>
            <span style="color: #FD971F;">input_mask_pad1</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span>length_first-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>input_mask1<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            input_mask1.extend<span style="color: #AE81FF;">(</span>input_mask_pad1<span style="color: #AE81FF;">)</span>

        <span style="color: #FD971F;">text2</span>=spl+text2
        <span style="color: #FD971F;">tokeniz_text2</span> = <span style="color: #F92672;">self</span>.tokenizer.tokenize<span style="color: #AE81FF;">(</span>text2<span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">indextokens2</span> = <span style="color: #F92672;">self</span>.tokenizer.convert_tokens_to_ids<span style="color: #AE81FF;">(</span>tokeniz_text2<span style="color: #AE81FF;">)</span>

        <span style="color: #FD971F;">length_second</span>=<span style="color: #F92672;">self</span>.max_sentence_length-length_first
        <span style="color: #FD971F;">length2_begin</span>=length_first

        <span style="color: #FD971F;">input_mask2</span> = <span style="color: #AE81FF;">[</span>1<span style="color: #AE81FF;">]</span> * <span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens2<span style="color: #AE81FF;">)</span>

        <span style="color: #F92672;">if</span> length_second&lt;<span style="color: #F92672;">len</span><span style="color: #AE81FF;">(</span>indextokens2<span style="color: #AE81FF;">)</span>:
            <span style="color: #FD971F;">indextokens2</span>=indextokens2<span style="color: #AE81FF;">[</span>:length_second<span style="color: #AE81FF;">]</span>
            <span style="color: #FD971F;">input_mask2</span>=input_mask2<span style="color: #AE81FF;">[</span>:length_second<span style="color: #AE81FF;">]</span>
        <span style="color: #F92672;">else</span>:
            <span style="color: #FD971F;">pad_indextokens2</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span>length_second-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>indextokens2<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            indextokens2.extend<span style="color: #AE81FF;">(</span>pad_indextokens2<span style="color: #AE81FF;">)</span>
            <span style="color: #FD971F;">input_mask_pad2</span> = <span style="color: #AE81FF;">[</span>0<span style="color: #AE81FF;">]</span>*<span style="color: #AE81FF;">(</span>length_second-<span style="color: #F92672;">len</span><span style="color: #66D9EF;">(</span>input_mask2<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
            input_mask2.extend<span style="color: #AE81FF;">(</span>input_mask_pad2<span style="color: #AE81FF;">)</span>


        indextokens1.extend<span style="color: #AE81FF;">(</span>indextokens2<span style="color: #AE81FF;">)</span>
        input_mask1.extend<span style="color: #AE81FF;">(</span>input_mask2<span style="color: #AE81FF;">)</span>
        <span style="color: #FD971F;">indextokens</span>=torch.tensor<span style="color: #AE81FF;">(</span>indextokens1,dtype=torch.<span style="color: #F92672;">long</span><span style="color: #AE81FF;">)</span>
        <span style="color: #75715E;"># </span><span style="color: #75715E;">segment_id=torch.tensor(segment_id,dtype=torch.long)</span>
        <span style="color: #FD971F;">input_mask</span>=torch.tensor<span style="color: #AE81FF;">(</span>input_mask1,dtype=torch.<span style="color: #F92672;">long</span><span style="color: #AE81FF;">)</span>

        <span style="color: #F92672;">return</span> indextokens,<span style="color: #AE81FF;">None</span>,input_mask

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">convert_ids_to_tokens</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, index<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.tokenizer.convert_ids_to_tokens<span style="color: #AE81FF;">(</span>index<span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">convert_prediction_result2_sentence</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,output_prediction<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">output_index</span>=output_prediction.cpu<span style="color: #AE81FF;">()[</span>0<span style="color: #AE81FF;">]</span>.numpy<span style="color: #AE81FF;">()</span>.tolist<span style="color: #AE81FF;">()</span>
        <span style="color: #75715E;"># </span><span style="color: #75715E;">print(output_index)</span>
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.tokenizer.convert_ids_to_tokens<span style="color: #AE81FF;">(</span>output_index<span style="color: #AE81FF;">)</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">indextoken2wordtoken</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,index<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.tokenizer.convert_ids_to_tokens<span style="color: #AE81FF;">(</span>index<span style="color: #AE81FF;">)</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">convert_tokens_to_ids</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>,token<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.tokenizer.convert_tokens_to_ids<span style="color: #AE81FF;">(</span>token<span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">get_max_seq_length</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">return</span> <span style="color: #F92672;">self</span>.max_sentence_length
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-03-28 周日 00:00</p>
<p class="author">Author: 梁子</p>
<p class="date">Created: 2021-03-28 周日 16:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
